# CLASS IN OBJECT ORIENTED PROGRAMMING

In [1]:
a = 23
print(type(a))

<class 'int'>

In [2]:
b = -45
print(type(b))

<class 'int'>

In [3]:
c = 24.59
print(type(c))

<class 'float'>

In [4]:
d = [1, 2, 3, 4, 5]
print(type(d))

<class 'list'>

DATAFRAME ATTRIBUTES AND METHODS

In [7]:
data = {
    "Roll_no.": [101, 102, 103],
    "Names": ["Ayushi", "Pranay", "Janvi"],
    "Marks": [78.27, 87, 90],
    "Hobbies": ["Reading", "Singing", "Dancing"]
}
print(type(data))

<class 'dict'>

In [8]:
import pandas as pd
df = pd.DataFrame(data)
df

   Roll_no.   Names  Marks  Hobbies
0       101  Ayushi  78.27  Reading
1       102  Pranay  87.00  Singing
2       103   Janvi  90.00  Dancing

In [9]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

DATAFRAME ATTRIBUTES
1. df.columns
2. df.index
3. df.values
4. df.shape
5. df.dtypes
6. df.size

In [10]:
df.columns

Index(['Roll_no.', 'Names', 'Marks', 'Hobbies'], dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
df.values

array([[101, 'Ayushi', 78.27, 'Reading'],
       [102, 'Pranay', 87.0, 'Singing'],
       [103, 'Janvi', 90.0, 'Dancing']], dtype=object)

In [13]:
df.shape

(3, 4)

In [14]:
df.dtypes

Roll_no.      int64
Names        object
Marks       float64
Hobbies      object
dtype: object

In [15]:
df.size

12

METHODS OF CLASS DATAFRAME
1. df.abs()
2. df.add()
3. df.aggregate()
4. df.assign
5. df.count()
6. df.describe()
7. df.drop() / df.drop_duplicates() / df.duplicated()
8. df.head()
9. df.info()
10. df.insert()
11. df.isna()
12. df.isnull()
13. df.items()
14. df.min() / df.max() / df.mean() / df.median()
15. df.sort_values() / df.groupby()

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Roll_no.  3 non-null      int64
 1   Names     3 non-null      object
 2   Marks     3 non-null      float64
 3   Hobbies   3 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 228.0+ bytes

In [17]:
df.sort_values(by="Marks", ascending=False)

   Roll_no.   Names  Marks  Hobbies
2       103   Janvi  90.00  Dancing
1       102  Pranay  87.00  Singing
0       101  Ayushi  78.27  Reading

In [19]:
df['Marks'].sum()

np.float64(255.26999999999998)

In [21]:
df["Marks"].mean()

np.float64(85.08999999999999)

In [22]:
df.describe()

       Roll_no.      Marks
count       3.0   3.000000
mean      102.0  85.090000
std         1.0   6.093792
min       101.0  78.270000
25%       101.5  82.635000
50%       102.0  87.000000
75%       102.5  88.500000
max       103.0  90.000000

# CREATING A PERSON CLASS

__init__ :- is constructor function used to define attributes

In [2]:
class Person:
    def __init__(self, name, age, gender, occupation):
        self.name = name
        self.age = age
        self.gender = gender
        self.occupation = occupation
    
    def talk(self):
        print(f"My name is {self.name}")
        print(f"I am {self.age} years old")
        print(f"I am a {self.gender}")
        print(f"I work as a/ an {self.occupation}")

In [3]:
p1 = Person("Ayushi", 23, "Female", "Data Scientist" )

In [4]:
p1.talk()

My name is Ayushi
I am 23 years old
I am a Female
I work as a/ an Data Scientist

In [5]:
print(type(p1))

<class '__main__.Person'>

__main__ reffers to current working file in python

In [6]:
p1.name

'Ayushi'

In [7]:
p1.age

23

In [8]:
p1.gender

'Female'

In [9]:
p1.occupation

'Data Scientist'

In [10]:
p2 = Person(name = "Pradutt", age= 18, gender= "Male", occupation="Student")

In [11]:
p2.talk()

My name is Pradutt
I am 18 years old
I am a Male
I work as a/ an Student

In [16]:
# changing the data 
p2.age = 21

In [13]:
p2.age

21

In [14]:
p2.name = "Pranay"

In [15]:
p2.name

'Pranay'

CREATING A CLASS USING DATACLASSES